{"card_name": "Cinderhoof Minotaur", "color": "R", "rarity": "rare", "type": "Creature – Minotaur Shaman", "number": 138, "color_identity": "R", "cost": "{R}{R}", "rules_text": "Trample\nWhenever a player casts a spell, Cinderhoof Minotaur deals 1 damage to that player.\nWhenever Cinderhoof Minotaur attacks, add {R}. Until end of turn, you don’t lose this mana as steps and phases end.", "pt": "3/2", "special_text": "", "shape": "normal", "set": "TTR", "loyalty": "", "notes": "QCX\nMKO 05/17/23 — this will be reverse boros reckoner. no hiding in the full set reveal\nRDZ\nPOTENTIAL REDESIGN\n-\n$P Minotaur\n-\nMKO 03/09/23 — played monoR in gpp. [[Rakkiri Dissident]] — drop haste?\nv5\nXR, T: Exile target instant, sorcery, or creature card from your graveyard with mana value X. You may cast a copy of that spell without paying its mana cost. If you cast a creature spell this way, it gains haste and “At the beginning of each end step, exile this creature.” Activate only as a sorcery.\nv4\nT, Exile a creature card from your graveyard: Create a token that’s a copy of that creature, except it’s a 2/3 Minotaur Spirit creature with haste and “At the beginning of the end step, sacrifice this permanent.”\nv3\nR, T: Exile two noncreature cards from your graveyard: Put a +1/+1 counter on each Minotaur you control. Activate only as a sorcery.\nR, T: Exile two creature cards from your graveyard: Create a 2/3 red Minotaur creature token. Activate only as a sorcery.\nv2\nT: You may cast target card from your graveyard if it has mana value 3 or less or if it’s a Minotaur this turn. If an instant or sorcery spell cast this way would be put into your graveyard, exile it instead. If you cast a permanent spell this way, it gains haste and “At the beginning of the end step, exile this permanent.” Activate only as a sorcery.\nv1\n1R, T, Discard a card: RR01 Skophos Soulspeaker deals 2 damage to any target.\nDuring each of your turns, you may cast a Minotaur card from your graveyard. When you do, that spell gains haste and “At the beginning of the end step, exile this permanent.”"}